# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.


user_number = input("Введите целое положительное число: ")
print(max(user_number))

# не понимаю, как использовать while в данном случае, в частности, как тогда "зайти" в число пользов. и перебрать
    # до самого большего